#include "Component.h"

Component::Component() = default;

Component::~Component() {
}

//-----------------------------------------------------------------------------
// Purpose: エンティティにアタッチされたときに呼び出されます
// 基底ではオーナーを設定します
//-----------------------------------------------------------------------------
void Component::OnAttach(Entity& owner) {
	this->owner_ = &owner;
}

//-----------------------------------------------------------------------------
// Purpose: 描画処理のあるコンポーネントはこの関数をオーバーライドします
//-----------------------------------------------------------------------------
void Component::Render([[maybe_unused]] ID3D12GraphicsCommandList* commandList) {
}

//-----------------------------------------------------------------------------
// Purpose: エディター専用のコンポーネントを作成する場合はこの関数をオーバーライドします
//----------------------------------------------------------------------------- 
bool Component::IsEditorOnly() const {
	return false;
}

Entity* Component::GetOwner() const {
	return owner_;
}
